[
    {
      "breed": "Toy Poodle",
      "origin": "France",
      "size": "Small",
      "img":"/images/toypoodle.jpg",
      "weight": "4-6 lbs (2-3 kg)",
      "personality": "Intelligent, alert, and friendly",
      "life_expectancy": "12-15 years",
      "fun_fact": "Toy Poodles are one of the most intelligent dog breeds and are great at performing tricks.",
      "long_description": "The Toy Poodle is a small, elegant dog breed known for its intelligence and hypoallergenic coat. Originally bred as a companion dog, the Toy Poodle is highly trainable and enjoys being the center of attention. They are friendly, affectionate, and good with children and other pets. Despite their small size, Toy Poodles are energetic and enjoy mental and physical stimulation. They require regular grooming to maintain their curly coat, but they are low-shedding, making them a great choice for people with allergies."
    },
    {
      "breed": "Papillon",
      "origin": "France/Belgium",
      "size": "Small",
      "img":"/images/papillon.jpg",
      "weight": "5-10 lbs (2-4.5 kg)",
      "personality": "Friendly, intelligent, and energetic",
      "life_expectancy": "12-16 years",
      "fun_fact": "Papillons get their name from their butterfly-like ears.",
      "long_description": "Papillons are small, elegant dogs known for their distinctive butterfly-shaped ears. They are intelligent, energetic, and love being around people. Originally bred as companion dogs, they excel in agility and obedience training. Despite their delicate appearance, Papillons are hardy and active, enjoying playtime and mental challenges. They require moderate grooming to keep their coat in good condition."
    },
    {
      "breed": "Chihuahua",
      "origin": "Mexico",
      "size": "Small",
      "img":"/images/chihuahua.jpg",
      "weight": "2-6 lbs (1-3 kg)",
      "personality": "Loyal, bold, and alert",
      "life_expectancy": "14-17 years",
      "fun_fact": "Chihuahuas are the smallest dog breed in the world.",
      "long_description": "Chihuahuas are tiny yet full of personality. Known for their loyalty and bold nature, they form strong bonds with their owners and can be quite protective. Despite their small size, they are confident and fearless. Chihuahuas require minimal grooming but enjoy staying warm, often seeking cozy places to snuggle. They make great apartment pets and are best suited for owners who appreciate their spirited attitude."
    },
    {
      "breed": "Pomeranian",
      "origin": "Germany/Poland",
      "size": "Small",
      "img":"/images/pomeranian.jpg",
      "weight": "3-7 lbs (1.5-3 kg)",
      "personality": "Lively, intelligent, and affectionate",
      "life_expectancy": "12-16 years",
      "fun_fact": "Pomeranians have a thick double coat that requires regular grooming.",
      "long_description": "Pomeranians are tiny yet energetic dogs with a fluffy coat and a bold personality. They are highly intelligent and love being the center of attention. Originally bred from larger sled dogs, Pomeranians have retained their lively spirit and enjoy mental stimulation and play. They require regular grooming due to their thick double coat but are low-maintenance in terms of exercise. Pomeranians make excellent companions for those who appreciate their affectionate and spunky nature."
    },
    {
      "breed": "Maltese",
      "origin": "Mediterranean",
      "size": "Small",
      "img":"/images/maltese.jpg",
      "weight": "4-7 lbs (2-3 kg)",
      "personality": "Gentle, affectionate, and playful",
      "life_expectancy": "12-15 years",
      "fun_fact": "Maltese dogs have been popular companion animals for thousands of years.",
      "long_description": "Maltese dogs are known for their silky white coats and affectionate personalities. They have been beloved companion dogs for centuries and are known for their gentle and friendly nature. Despite their small size, they are lively and enjoy playing. Maltese require regular grooming to maintain their long coat, but they are hypoallergenic and shed very little. They are excellent lap dogs and thrive on human companionship."
    },
    {
      "breed": "Yorkshire Terrier",
      "origin": "England",
      "size": "Small",
      "img":"/images/yorkshireterrier.jpg",
      "weight": "4-7 lbs (2-3 kg)",
      "personality": "Spunky, affectionate, and brave",
      "life_expectancy": "11-15 years",
      "fun_fact": "Yorkies were originally bred to hunt rats in textile mills.",
      "long_description": "Yorkshire Terriers, or Yorkies, are small but full of confidence. Originally bred as working dogs, they are fearless and energetic. They form strong bonds with their owners and enjoy being involved in daily activities. Yorkies have a long, silky coat that requires regular grooming, but they are low-shedding. Despite their small stature, they have a bold personality and are known for their loyalty and affectionate nature."
    },
    {
      "breed": "Dachshund",
      "origin": "Germany",
      "size": "Small",
      "img":"/images/dachshund.jpg",
      "weight": "8-11 lbs (3.5-5 kg)",
      "personality": "Curious, playful, and brave",
      "life_expectancy": "12-16 years",
      "fun_fact": "Dachshunds were originally bred to hunt badgers, and their name means 'badger dog' in German.",
      "long_description": "Miniature Dachshunds are small, long-bodied dogs with a playful and curious nature. Originally bred for hunting, they are brave and determined. They enjoy exploring and are known for their strong-willed personality. Dachshunds form close bonds with their owners and can be very affectionate. They require minimal grooming and are well-suited for apartment living, but they benefit from daily walks and playtime."
    },
    {
      "breed": "Cavalier King Charles Spaniel",
      "origin": "England",
      "size": "Small",
      "img":"/images/cavalier.jpg",
      "weight": "13-18 lbs (6-8 kg)",
      "personality": "Affectionate, gentle, and friendly",
      "life_expectancy": "12-15 years",
      "fun_fact": "Cavalier King Charles Spaniels were named after King Charles II of England, who adored them.",
      "long_description": "Cavalier King Charles Spaniels are affectionate and friendly dogs that thrive on companionship. They are known for their expressive eyes and gentle nature, making them excellent family pets. Originally bred as lap dogs for royalty, they love cuddling and being close to their owners. Despite their small size, they enjoy outdoor activities and play. They require moderate grooming to maintain their silky coat and are well-suited for families and individuals alike."
    }
]